
        const THAI_DISTRICTS = {
            
          
    "กรุงเทพมหานคร": [
        "เขตคลองเตย","เขตคลองสามวา","เขตคลองสาน","เขตคันนายาว","เขตจตุจักร","เขตจอมทอง","เขตดอนเมือง","เขตดินแดง","เขตดุสิต","เขตตลิ่งชัน","เขตทวีวัฒนา","เขตทุ่งครุ","เขตธนบุรี","เขตบางกะปิ","เขตบางกอกน้อย","เขตบางกอกใหญ่","เขตบางขุนเทียน","เขตบางเขน","เขตบางคอแหลม","เขตบางแค","เขตบางซื่อ","เขตบางนา","เขตบางบอน","เขตบางพลัด","เขตบางรัก","เขตบึงกุ่ม","เขตปทุมวัน","เขตประเวศ","เขตป้อมปราบศัตรูพ่าย","เขตพญาไท","เขตพระโขนง","เขตพระนคร","เขตภาษีเจริญ","เขตมีนบุรี","เขตยานนาวา","เขตราษฎร์บูรณะ","เขตราชเทวี","เขตลาดกระบัง","เขตลาดพร้าว","เขตวังทองหลาง","เขตวัฒนา","เขตสวนหลวง","เขตสะพานสูง","เขตสัมพันธวงศ์","เขตสาทร","เขตสายไหม","เขตหนองจอก","เขตหนองแขม","เขตหลักสี่","เขตห้วยขวาง"
    ],
    "กระบี่": [
        "อำเภอเมืองกระบี่","อำเภอเกาะลันตา","อำเภอคลองท่อม","อำเภออ่าวลึก","อำเภอปลายพระยา","อำเภอเขาพนม","อำเภอเหนือคลอง","อำเภอลำทับ"
    ],
    
    "กาญจนบุรี": [
        "อำเภอเมืองกาญจนบุรี","อำเภอไทรโยค","อำเภอบ่อพลอย","อำเภอศรีสวัสดิ์","อำเภอท่ามะกา","อำเภอท่าม่วง","อำเภอทองผาภูมิ","อำเภอสังขละบุรี","อำเภอพนมทวน","อำเภอเลาขวัญ","อำเภอด่านมะขามเตี้ย","อำเภอหนองปรือ","อำเภอห้วยกระเจา"
    ],
   
    "กาฬสินธุ์": [
        "อำเภอเมืองกาฬสินธุ์","อำเภอนาคู","อำเภอกมลาไสย","อำเภอกุฉินารายณ์","อำเภอฆ้องชัย","อำเภอคำม่วง","อำเภอท่าคันโท","อำเภอโนนสะอาด","อำเภอดอนจาน","อำเภอเดชอุดม","อำเภอยางตลาด","อำเภอสมเด็จ","อำเภอสหัสขันธ์","อำเภอสามชัย","อำเภอหนองกุงศรี","อำเภอห้วยผึ้ง","อำเภอห้วยเม็ก","อำเภอเขาวง"
    ],
    
    "กำแพงเพชร": [
        "อำเภอเมืองกำแพงเพชร","อำเภอไทรงาม","อำเภอคลองคลุง","อำเภอขาณุวรลักษบุรี","อำเภอคลองขลุง","อำเภอพรานกระต่าย","อำเภอลานกระบือ","อำเภอโกสัมพีนคร","อำเภอบึงสามัคคี","อำเภอคลองลาน","อำเภอทรายทองวัฒนา"
    ],
   
    "ขอนแก่น": [
        "อำเภอเมืองขอนแก่น","อำเภอบ้านฝาง","อำเภอพระยืน","อำเภอหนองเรือ","อำเภอชุมแพ","อำเภอสีชมพู","อำเภอน้ำพอง","อำเภออุบลรัตน์","อำเภอกระนวน","อำเภอแวงใหญ่","อำเภอแวงน้อย","อำเภอพล","อำเภอหนองสองห้อง","อำเภอบ้านไผ่","อำเภอเปือยน้อย","อำเภอซำสูง","อำเภอโคกโพธิ์ไชย","อำเภอชนบท","อำเภอมัญจาคีรี","อำเภอเขาสวนกวาง","อำเภอภูเวียง","อำเภอหนองนาคำ","อำเภอบ้านแฮด","อำเภอโนนศิลา","อำเภอเวียงเก่า","อำเภอภูผาม่าน"
    ],
  
    "จันทบุรี": [
        "อำเภอเมืองจันทบุรี","อำเภอขลุง","อำเภอท่าใหม่","อำเภอโป่งน้ำร้อน","อำเภอมะขาม","อำเภอแหลมสิงห์","อำเภอสอยดาว","อำเภอแก่งหางแมว","อำเภอนายายอาม","อำเภอเขาคิชฌกูฏ"
    ],
   
    "ฉะเชิงเทรา": [
        "อำเภอเมืองฉะเชิงเทรา","อำเภอบางคล้า","อำเภอบางน้ำเปรี้ยว","อำเภอบางปะกง","อำเภอพนมสารคาม","อำเภอราชสาส์น","อำเภอสนามชัยเขต","อำเภอแปลงยาว","อำเภอท่าตะเกียบ","อำเภอคลองเขื่อน","อำเภอบ้านโพธิ์"
    ],
    "ชลบุรี": [
        "อำเภอเมืองชลบุรี","อำเภอหนองใหญ่","อำเภอบ้านบึง","อำเภอพนัสนิคม","อำเภอพานทอง","อำเภอศรีราชา","อำเภอเกาะสีชัง","อำเภอบางละมุง","อำเภอสัตหีบ","อำเภอบ่อทอง","อำเภอเกาะจันทร์"
    ],
    "ชัยนาท": [
        "อำเภอเมืองชัยนาท","อำเภอมโนรมย์","อำเภอวัดสิงห์","อำเภอสรรพยา","อำเภอสรรคบุรี","อำเภอหันคา","อำเภอหนองมะโมง","อำเภอเนินขาม"
    ],
    "ชัยภูมิ": [
        "อำเภอเมืองชัยภูมิ","อำเภอบ้านเขว้า","อำเภอคอนสวรรค์","อำเภอแก้งคร้อ","อำเภอภูเขียว","อำเภอบำเหน็จณรงค์","อำเภอเทพสถิต","อำเภอคอนสาร","อำเภอเกษตรสมบูรณ์","อำเภอหนองบัวแดง","อำเภอบ้านแท่น","อำเภอโคกโพธิ์ไชย","อำเภอภักดีชุมพล","อำเภอเนินสง่า","อำเภอซับใหญ่","อำเภอหนองบัวระเหว"
    ],
    "ชุมพร": [
        "อำเภอเมืองชุมพร","อำเภอท่าแซะ","อำเภอปะทิว","อำเภอหลังสวน","อำเภอละแม","อำเภอสวี","อำเภอพะโต๊ะ","อำเภอทุ่งตะโก"
    ],
    "เชียงราย": [
        "อำเภอเมืองเชียงราย","อำเภอเชียงของ","อำเภอเชียงแสน","อำเภอแม่สาย","อำเภอแม่จัน","อำเภอแม่สรวย","อำเภอแม่ลาว","อำเภอเวียงชัย","อำเภอเวียงแก่น","อำเภอเวียงป่าเป้า","อำเภอพญาเม็งราย","อำเภอพาน","อำเภอเทิง","อำเภอแม่ฟ้าหลวง","อำเภอแม่เปา","อำเภอดอยหลวง","อำเภอเวียงเชียงรุ้ง","อำเภอขุนตาล"
    ],
    "เชียงใหม่": [
        "อำเภอเมืองเชียงใหม่","อำเภอจอมทอง","อำเภอเชียงดาว","อำเภอดอยสะเก็ด","อำเภอดอยเต่า","อำเภอดอยหล่อ","อำเภอฝาง","อำเภอพร้าว","อำเภอแม่ริม","อำเภอแม่แจ่ม","อำเภอแม่แตง","อำเภอแม่วาง","อำเภอแม่ออน","อำเภอไชยปราการ","อำเภอเวียงแหง","อำเภอสะเมิง","อำเภอสันกำแพง","อำเภอสันทราย","อำเภอสันป่าตอง","อำเภอสารภี","อำเภอหางดง","อำเภอฮอด","อำเภออมก๋อย","อำเภอกัลยาณิวัฒนา","อำเภอแม่อาย"
    ],
    "ตรัง": [
        "อำเภอเมืองตรัง","อำเภอกันตัง","อำเภอห้วยยอด","อำเภอเขาขาว","อำเภอหนองเป็ด","อำเภอวังวิเศษ","อำเภอนาโยง","อำเภอปะเหลียน","อำเภอสิเกา","อำเภอรัษฎา"
    ],
    "ตราด": [
        "อำเภอเมืองตราด","อำเภอคลองใหญ่","อำเภอเขาสมิง","อำเภอบ่อไร่","อำเภอแหลมงอบ","อำเภอเกาะกูด","อำเภอเกาะช้าง"
    ],
    "ตาก": [
        "อำเภอเมืองตาก","อำเภอแม่สอด","อำเภอบ้านตาก","อำเภอสามเงา","อำเภอแม่ระมาด","อำเภอท่าสองยาง","อำเภออุ้มผาง","อำเภอพบพระ","อำเภอวังเจ้า"
    ],
    "นครนายก": [
        "อำเภอเมืองนครนายก","อำเภอบ้านนา","อำเภอองครักษ์","อำเภอปากพลี"
    ],
    "นครปฐม": [
        "อำเภอเมืองนครปฐม","อำเภอกำแพงแสน","อำเภอนครชัยศรี","อำเภอดอนตูม","อำเภอบางเลน","อำเภอสามพราน","อำเภอพุทธมณฑล"
    ],
    "นครพนม": [
        "อำเภอเมืองนครพนม","อำเภอธาตุพนม","อำเภอนาแก","อำเภอท่าอุเทน","อำเภอเรณูนคร","อำเภอบ้านแพง","อำเภอปลาปาก","อำเภอศรีสงคราม","อำเภอนาหว้า","อำเภอโพนสวรรค์","อำเภอนาทม","อำเภอวังยาง"
    ],
    "นครราชสีมา": [
        "อำเภอเมืองนครราชสีมา","อำเภอครบุรี","อำเภอเสิงสาง","อำเภอคง","อำเภอบ้านเหลื่อม","อำเภอจักราช","อำเภอโชคชัย","อำเภอด่านขุนทด","อำเภอโนนไทย","อำเภอโนนสูง","อำเภอขามสะแกแสง","อำเภอบัวใหญ่","อำเภอประทาย","อำเภอปักธงชัย","อำเภอพิมาย","อำเภอห้วยแถลง","อำเภอชุมพวง","อำเภอสูงเนิน","อำเภอขามทะเลสอ","อำเภอสีคิ้ว","อำเภอปากช่อง","อำเภอหนองบุญมาก","อำเภอแก้งสนามนาง","อำเภอโนนแดง","อำเภอวังน้ำเขียว","อำเภอเทพารักษ์","อำเภอเมืองยาง","อำเภอเฉลิมพระเกียรติ","อำเภอพระทองคำ","อำเภอบัวลาย","อำเภอสีดา","อำเภอลำทะเมนชัย"
    ],
    "นครศรีธรรมราช": [
        "อำเภอเมืองนครศรีธรรมราช","อำเภอขนอม","อำเภอฉวาง","อำเภอชะอวด","อำเภอเชียรใหญ่","อำเภอถ้ำพรรณรา","อำเภอทุ่งสง","อำเภอทุ่งใหญ่","อำเภอนบพิตำ","อำเภอปากพนัง","อำเภอพรหมคีรี","อำเภอพระพรหม","อำเภอพิปูน","อำเภอเฉลิมพระเกียรติ","อำเภอจุฬาภรณ์","อำเภอช้างกลาง","อำเภอท่าศาลา","อำเภอนาบอน","อำเภอบางขัน","อำเภอสิชล","อำเภอหัวไทร","อำเภอถ้ำใหญ่","อำเภอร่อนพิบูลย์"
    ],
    "นครสวรรค์": [
        "อำเภอเมืองนครสวรรค์","อำเภอโกรกพระ","อำเภอชุมแสง","อำเภอตาคลี","อำเภอท่าตะโก","อำเภอบรรพตพิสัย","อำเภอพยุหะคีรี","อำเภอไพศาลี","อำเภอลาดยาว","อำเภอหนองบัว","อำเภอมาม่า","อำเภอเก้าเลี้ยว","อำเภอตากฟ้า","อำเภอแม่วงก์","อำเภอแม่เปิน"
    ],
    "นนทบุรี": [
        "อำเภอเมืองนนทบุรี","อำเภอบางกรวย","อำเภอบางใหญ่","อำเภอบางบัวทอง","อำเภอไทรน้อย","อำเภอปากเกร็ด"
    ],
    "นราธิวาส": [
        "อำเภอเมืองนราธิวาส","อำเภอจะแนะ","อำเภอเจาะไอร้อง","อำเภอตากใบ","อำเภอบาเจาะ","อำเภอระแงะ","อำเภอรือเสาะ","อำเภอแว้ง","อำเภอศรีสาคร","อำเภอสุคิริน","อำเภอสุไหงโกลก","อำเภอสุไหงปาดี","อำเภอยี่งอ"
    ],
    "น่าน": [
    "อำเภอเมืองน่าน","อำเภอนาหมื่น","อำเภอนาน้อย","อำเภอเวียงสา","อำเภอท่าวังผา","อำเภอแม่จริม","อำเภอสันติสุข","อำเภอเชียงกลาง","อำเภอทุ่งช้าง","อำเภอสองแคว","อำเภอเฉลิมพระเกียรติ","อำเภอบ่อเกลือ","อำเภอบ้านหลวง","อำเภอภูเพียง","อำเภอภูกามยาว"
    ],
    "บึงกาฬ": [
    "อำเภอเมืองบึงกาฬ","อำเภอเซกา","อำเภอโซ่พิสัย","อำเภอบึงโขงหลง","อำเภอปากคาด","อำเภอพรเจริญ","อำเภอศรีวิไล","อำเภอบุ่งคล้า"
    ],
    "บุรีรัมย์": [
    "อำเภอเมืองบุรีรัมย์","อำเภอกระสัง","อำเภอคูเมือง","อำเภอแคนดง","อำเภอเฉลิมพระเกียรติ","อำเภอชำนิ","อำเภอนาโพธิ์","อำเภอนางรอง","อำเภอโนนดินแดง","อำเภอโนนสุวรรณ","อำเภอบ้านด่าน","อำเภอบ้านใหม่ไชยพจน์","อำเภอประโคนชัย","อำเภอปะคำ","อำเภอพลับพลาชัย","อำเภอละหานทราย","อำเภอละแม","อำเภอสตึก","อำเภอหนองกี่","อำเภอหนองหงส์","อำเภอห้วยราช","อำเภอพุทไธสง","อำเภอโนนสวรรค์"
    ],
    "ปทุมธานี": [
    "อำเภอเมืองปทุมธานี","อำเภอคลองหลวง","อำเภอธัญบุรี","อำเภอลาดหลุมแก้ว","อำเภอลำลูกกา","อำเภอหนองเสือ","อำเภอสามโคก"
    ],
    "ประจวบคีรีขันธ์": [
    "อำเภอเมืองประจวบคีรีขันธ์","อำเภอกุยบุรี","อำเภอทับสะแก","อำเภอบางสะพาน","อำเภอบางสะพานน้อย","อำเภอปราณบุรี","อำเภอหัวหิน","อำเภอสามร้อยยอด"
    ],
    "ปราจีนบุรี": [
    "อำเภอเมืองปราจีนบุรี","อำเภอกบินทร์บุรี","อำเภอนาดี","อำเภอบ้านสร้าง","อำเภอประจันตคาม","อำเภอศรีมหาโพธิ","อำเภอศรีมโหสถ"
    ],
    "ปัตตานี": [
    "อำเภอเมืองปัตตานี","อำเภอกะพ้อ","อำเภอโคกโพธิ์","อำเภอมายอ","อำเภอแม่ลาน","อำเภอไม้แก่น","อำเภอยะรัง","อำเภอสายบุรี","อำเภอหนองจิก","อำเภอทุ่งยางแดง","อำเภอปะนาเระ","อำเภอมายอ"
    ],
    "พระนครศรีอยุธยา": [
    "อำเภอพระนครศรีอยุธยา","อำเภอท่าเรือ","อำเภอนครหลวง","อำเภอบางซ้าย","อำเภอบางไทร","อำเภอบางบาล","อำเภอบางปะอิน","อำเภอบางปะหัน","อำเภอผักไห่","อำเภอภาชี","อำเภอลาดบัวหลวง","อำเภอวังน้อย","อำเภอเสนา","อำเภออุทัย","อำเภอมหาราช","อำเภอบ้านแพรก"
    ],
    "พะเยา": [
    "อำเภอเมืองพะเยา","อำเภอจุน","อำเภอเชียงคำ","อำเภอเชียงม่วน","อำเภอดอกคำใต้","อำเภอปง","อำเภอแม่ใจ","อำเภอภูซาง","อำเภอภูกามยาว"
    ],
    "พังงา": [
    "อำเภอเมืองพังงา","อำเภอเกาะยาว","อำเภอกะปง","อำเภอคุระบุรี","อำเภอตะกั่วทุ่ง","อำเภอตะกั่วป่า","อำเภอทับปุด","อำเภอท้ายเหมือง"
    ],
    "พัทลุง": [
    "อำเภอเมืองพัทลุง","อำเภอกงหรา","อำเภอเขาชัยสน","อำเภอควนขนุน","อำเภอควนเนียง","อำเภอบางแก้ว","อำเภอปากพะยูน","อำเภอศรีบรรพต","อำเภอศรีนครินทร์","อำเภอป่าพะยอม","อำเภอป่าบอน"
    ],
    "พิจิตร": [
    "อำเภอเมืองพิจิตร","อำเภอตะพานหิน","อำเภอโพทะเล","อำเภอสามง่าม","อำเภอโพธิ์ประทับช้าง","อำเภอวชิรบารมี","อำเภอทับคล้อ","อำเภอบางมูลนาก","อำเภอบึงนาราง","อำเภอวังทรายพูน","อำเภอสากเหล็ก","อำเภอวังกะพง"
    ],
    "พิษณุโลก": [
    "อำเภอเมืองพิษณุโลก","อำเภอนครไทย","อำเภอชาติตระการ","อำเภอวังทอง","อำเภอบางกระทุ่ม","อำเภอบางระกำ","อำเภอพรหมพิราม","อำเภอวัดโบสถ์","อำเภอเนินมะปราง"
    ],
    "เพชรบุรี": [
    "อำเภอเมืองเพชรบุรี","อำเภอเขาย้อย","อำเภอชะอำ","อำเภอท่ายาง","อำเภอบ้านลาด","อำเภอบ้านแหลม","อำเภอแก่งกระจาน","อำเภอหนองหญ้าปล้อง"
    ],
    "เพชรบูรณ์": [
    "อำเภอเมืองเพชรบูรณ์","อำเภอชนแดน","อำเภอหล่มเก่า","อำเภอหล่มสัก","อำเภอวิเชียรบุรี","อำเภอบึงสามพัน","อำเภอศรีเทพ","อำเภอหนองไผ่","อำเภอวังโป่ง","อำเภอน้ำหนาว","อำเภอเขาค้อ"
    ],
    "แพร่": [
    "อำเภอเมืองแพร่","อำเภอเด่นชัย","อำเภอสูงเม่น","อำเภอวังชิ้น","อำเภอลอง","อำเภอสอง","อำเภอหนองม่วงไข่","อำเภอห้วยไร่"
    ],
    "ภูเก็ต": [
    "อำเภอเมืองภูเก็ต","อำเภอกะทู้","อำเภอถลาง"
    ],
    "มหาสารคาม": [
    "อำเภอเมืองมหาสารคาม","อำเภอแกดำ","อำเภอโกสุมพิสัย","อำเภอกันทรวิชัย","อำเภอเชียงยืน","อำเภอชื่นชม","อำเภอพยัคฆภูมิพิสัย","อำเภอนาเชือก","อำเภอนาดูน","อำเภอบรบือ","อำเภอวาปีปทุม","อำเภอยางสีสุราช","อำเภอกุดรัง"
    ],
    "มุกดาหาร": [
    "อำเภอเมืองมุกดาหาร","อำเภอคำชะอี","อำเภอดอนตาล","อำเภอดงหลวง","อำเภอนิคมคำสร้อย","อำเภอหนองสูง","อำเภอหว้านใหญ่"
    ],
    "แม่ฮ่องสอน": [
    "อำเภอเมืองแม่ฮ่องสอน","อำเภอแม่สะเรียง","อำเภอขุนยวม","อำเภอปาย","อำเภอแม่ลาน้อย","อำเภอสบเมย","อำเภอปางมะผ้า"
    ],
    "ยโสธร": [
    "อำเภอเมืองยโสธร","อำเภอคำเขื่อนแก้ว","อำเภอค้อวัง","อำเภอกุดชุม","อำเภอทรายมูล","อำเภอไทยเจริญ","อำเภอมหาชนะชัย","อำเภอเลิงนกทา","อำเภอป่าติ้ว"
    ],
    "ยะลา": [
    "อำเภอเมืองยะลา","อำเภอกาบัง","อำเภอธารโต","อำเภอบันนังสตา","อำเภอเบตง","อำเภอยะหา","อำเภอรามัน","อำเภอกรงปินัง"
    ],
    "ร้อยเอ็ด": [
    "อำเภอเมืองร้อยเอ็ด","อำเภอเกษตรวิสัย","อำเภอจตุรพักตรพิมาน","อำเภอจังหาร","อำเภอเชียงขวัญ","อำเภอโพนทอง","อำเภอโพธิ์ชัย","อำเภอโพนทราย","อำเภอเมยวดี","อำเภอศรีสมเด็จ","อำเภอสุวรรณภูมิ","อำเภอเสลภูมิ","อำเภอหนองพอก","อำเภอหนองฮี","อำเภออาจสามารถ","อำเภอเมืองสรวง","อำเภอธวัชบุรี","อำเภอพนมไพร","อำเภอหนองกุงศรี","อำเภอเมยวดี"
    ],
    "ระนอง": [
    "อำเภอเมืองระนอง","อำเภอกะเปอร์","อำเภอละอุ่น","อำเภอสุขสำราญ","อำเภอละแม"
    ],
    "ระยอง": [
    "อำเภอเมืองระยอง","อำเภอแกลง","อำเภอบ้านค่าย","อำเภอบ้านฉาง","อำเภอปลวกแดง","อำเภอวังจันทร์","อำเภอเขาชะเมา","อำเภอนิคมพัฒนา"
    ],
    "ราชบุรี": [
    "อำเภอเมืองราชบุรี","อำเภอจอมบึง","อำเภอสวนผึ้ง","อำเภอดำเนินสะดวก","อำเภอบางแพ","อำเภอบ้านโป่ง","อำเภอโพธาราม","อำเภอปากท่อ","อำเภอวัดเพลง","อำเภอสวนหลวง"
    ],
    "ลพบุรี": [
    "อำเภอเมืองลพบุรี","อำเภอโคกสำโรง","อำเภอชัยบาดาล","อำเภอท่าวุ้ง","อำเภอทุ่งป่า","อำเภอบ้านหมี่","อำเภอพัฒนานิคม","อำเภอสระโบสถ์","อำเภอหนองม่วง","อำเภอโคกเจริญ","อำเภอลำสนธิ"
    ],
    "ลำปาง": [
    "อำเภอเมืองลำปาง","อำเภอเกาะคา","อำเภอแจ้ห่ม","อำเภอเถิน","อำเภอแม่ทะ","อำเภอแม่เมาะ","อำเภอวังเหนือ","อำเภอสบปราบ","อำเภอห้างฉัตร","อำเภอเมืองปาน","อำเภอแม่พริก","อำเภอเสริมงาม","อำเภอแจ้ห่ม"
    ],
    "ลำพูน": [
    "อำเภอเมืองลำพูน","อำเภอลี้","อำเภอทุ่งหัวช้าง","อำเภอบ้านโฮ่ง","อำเภอแม่ทา","อำเภอป่าซาง","อำเภอเวียงหนองล่อง","อำเภอบ้านธิ"
    ],
    "เลย": [
    "อำเภอเมืองเลย","อำเภอเชียงคาน","อำเภอด่านซ้าย","อำเภอท่าลี่","อำเภอนาด้วง","อำเภอนาแห้ว","อำเภอปากชม","อำเภอผาขาว","อำเภอภูกระดึง","อำเภอภูเรือ","อำเภอวังสะพุง","อำเภอเอราวัณ","อำเภอภูหลวง","อำเภอหนองหิน"
    ],
    "ศรีสะเกษ": [
    "อำเภอเมืองศรีสะเกษ","อำเภอกันทรลักษ์","อำเภอกันทรารมย์","อำเภอขุขันธ์","อำเภอขุนหาญ","อำเภอโนนคูณ","อำเภอน้ำเกลี้ยง","อำเภอบึงบูรพ์","อำเภอเบญจลักษ์","อำเภอปรางค์กู่","อำเภอภูสิงห์","อำเภอไพรบึง","อำเภอวารินชำราบ","อำเภอศรีรัตนะ","อำเภอห้วยทับทัน","อำเภออุทุมพรพิสัย","อำเภอราษีไศล","อำเภอศิลาลาด","อำเภอเมืองจันทร์","อำเภอโพธิ์ศรีสุวรรณ","อำเภอวังหิน"
    ],
    "สกลนคร": [
    "อำเภอเมืองสกลนคร","อำเภอกุดบาก","อำเภออากาศอำนวย","อำเภอวานรนิวาส","อำเภอพรรณานิคม","อำเภอพังโคน","อำเภอวาริชภูมิ","อำเภอสว่างแดนดิน","อำเภอส่องดาว","อำเภอหนองหาน","อำเภอเจริญศิลป์","อำเภอโคกศรีสุพรรณ","อำเภอเต่างอย","อำเภอนิคมน้ำอูน","อำเภอคำตากล้า","อำเภอโพนนาแก้ว","อำเภอภูพาน","อำเภอสอนร้อย"
    ],
    "สงขลา": [
    "อำเภอเมืองสงขลา","อำเภอกระแสสินธุ์","อำเภอคลองหอยโข่ง","อำเภอจะนะ","อำเภอเทพา","อำเภอนาทวี","อำเภอนาหม่อม","อำเภอบางกล่ำ","อำเภอระโนด","อำเภอรัตภูมิ","อำเภอสทิงพระ","อำเภอสะเดา","อำเภอสะบ้าย้อย","อำเภอสิงหนคร","อำเภอหาดใหญ่","อำเภอควนเนียง"
    ],
    "สตูล": [
    "อำเภอเมืองสตูล","อำเภอควนกาหลง","อำเภอควนโดน","อำเภอทุ่งหว้า","อำเภอท่าแพ","อำเภอละงู","อำเภอมะนัง"
    ],
    "สมุทรปราการ": [
    "อำเภอเมืองสมุทรปราการ","อำเภอบางบ่อ","อำเภอบางพลี","อำเภอบางเสาธง","อำเภอพระประแดง","อำเภอพระสมุทรเจดีย์"
    ],
    "สมุทรสงคราม": [
    "อำเภอเมืองสมุทรสงคราม","อำเภออัมพวา","อำเภอบางคนที"
    ],
    "สมุทรสาคร": [
    "อำเภอเมืองสมุทรสาคร","อำเภอกระทุ่มแบน","อำเภอบ้านแพ้ว"
    ],
    "สระแก้ว": [
    "อำเภอเมืองสระแก้ว","อำเภอคลองหาด","อำเภอวังน้ำเย็น","อำเภอวัฒนานคร","อำเภออรัญประเทศ","อำเภอเขาฉกรรจ์","อำเภอโคกสูง","อำเภอวังสมบูรณ์","อำเภอเบญจลักษ์"
    ],
    "สระบุรี": [
    "อำเภอเมืองสระบุรี","อำเภอแก่งคอย","อำเภอเฉลิมพระเกียรติ","อำเภอดอนพุด","อำเภอบ้านหมอ","อำเภอพระพุทธบาท","อำเภอมวกเหล็ก","อำเภอวิหารแดง","อำเภอเสาไห้","อำเภอหนองแซง","อำเภอหนองโดน","อำเภอหนองแค","อำเภอวังม่วง"
    ],
    "สิงห์บุรี": [
    "อำเภอเมืองสิงห์บุรี","อำเภอค่ายบางระจัน","อำเภอท่าช้าง","อำเภอบางระจัน","อำเภอพรหมบุรี","อำเภออินทร์บุรี"
    ],
    "สุโขทัย": [
    "อำเภอเมืองสุโขทัย","อำเภอศรีสำโรง","อำเภอสวรรคโลก","อำเภอศรีสัชนาลัย","อำเภอคีรีมาศ","อำเภอทุ่งเสลี่ยม","อำเภอบ้านด่านลานหอย","อำเภอศรีนคร","อำเภอเมืองสุโขทัย"
    ],
    "สุพรรณบุรี": [
    "อำเภอเมืองสุพรรณบุรี","อำเภอเดิมบางนางบวช","อำเภอด่านช้าง","อำเภอบางปลาม้า","อำเภอศรีประจันต์","อำเภออู่ทอง","อำเภอสองพี่น้อง","อำเภอสามชุก","อำเภอหนองหญ้าไซ","อำเภอดอนเจดีย์"
    ],
    "สุราษฎร์ธานี": [
    "อำเภอเมืองสุราษฎร์ธานี","อำเภอกาญจนดิษฐ์","อำเภอเกาะพะงัน","อำเภอเกาะสมุย","อำเภอคีรีรัฐนิคม","อำเภอเคียนซา","อำเภอชัยบุรี","อำเภอไชยา","อำเภอดอนสัก","อำเภอท่าฉาง","อำเภอท่าชนะ","อำเภอบ้านนาสาร","อำเภอบ้านตาขุน","อำเภอพุนพิน","อำเภอวิภาวดี","อำเภอเวียงสระ","อำเภอพนม","อำเภอพระแสง"
    ],
    "สุรินทร์": [
    "อำเภอเมืองสุรินทร์","อำเภอจอมพระ","อำเภอชุมพลบุรี","อำเภอท่าตูม","อำเภอโนนนารายณ์","อำเภอบัวเชด","อำเภอพนมดงรัก","อำเภอรัตนบุรี","อำเภอสนม","อำเภอศรีณรงค์","อำเภอสังขะ","อำเภอสำโรงทาบ","อำเภอสีขอ","อำเภอศีขรภูมิ","อำเภอเขวาสินรินทร์","อำเภอโคกโพธิ์ไชย","อำเภอลำดวน"
    ],
    "หนองคาย": [
    "อำเภอเมืองหนองคาย","อำเภอท่าบ่อ","อำเภอบึงกาฬ","อำเภอโพนพิสัย","อำเภอศรีเชียงใหม่","อำเภอสังคม","อำเภอสระใคร","อำเภอเฝ้าไร่","อำเภอรัตนวาปี"
    ],
    "หนองบัวลำภู": [
    "อำเภอเมืองหนองบัวลำภู","อำเภอนากลาง","อำเภอโนนสัง","อำเภอศรีบุญเรือง","อำเภอสุวรรณคูหา","อำเภอนาวัง"
    ],
    "อ่างทอง": [
    "อำเภอเมืองอ่างทอง","อำเภอไชโย","อำเภอป่าโมก","อำเภอโพธิ์ทอง","อำเภอวิเศษชัยชาญ","อำเภอสามโก้","อำเภอแสวงหา"
    ],
    "อำนาจเจริญ": [
    "อำเภอเมืองอำนาจเจริญ","อำเภอชานุมาน","อำเภอพนา","อำเภอปทุมราชวงศา","อำเภอพนมไพร","อำเภอหัวตะพาน","อำเภอเสนางคนิคม"
    ],
    "อุดรธานี": [
    "อำเภอเมืองอุดรธานี","อำเภอกุดจับ","อำเภอกุมภวาปี","อำเภอไชยวาน","อำเภอทุ่งฝน","อำเภอนายูง","อำเภอน้ำโสม","อำเภอโนนสะอาด","อำเภอบ้านดุง","อำเภอบ้านผือ","อำเภอเพ็ญ","อำเภอสร้างคอม","อำเภอหนองวัวซอ","อำเภอหนองแสง","อำเภอห้วยเกิ้ง","อำเภอหนองหาน","อำเภอประจักษ์ศิลปาคม","อำเภอพิบูลย์รักษ์","อำเภอวังสามหมอ","อำเภอศรีธาตุ"
    ],
    "อุตรดิตถ์": [
    "อำเภอเมืองอุตรดิตถ์","อำเภอทองแสนขัน","อำเภอท่าปลา","อำเภอน้ำปาด","อำเภอบ้านโคก","อำเภอพิชัย","อำเภอฟากท่า","อำเภอลับแล","อำเภอตรอน"
    ],
    "อุทัยธานี": [
    "อำเภอเมืองอุทัยธานี","อำเภอทัพทัน","อำเภอบ้านไร่","อำเภอสว่างอารมณ์","อำเภอหนองขาหย่าง","อำเภอหนองฉาง","อำเภอห้วยคต","อำเภอลานสัก"
    ],
    "อุบลราชธานี": [
    "อำเภอเมืองอุบลราชธานี","อำเภอเดชอุดม","อำเภอตาลสุม","อำเภอโพธิ์ไทร","อำเภอพิบูลมังสาหาร","อำเภอม่วงสามสิบ","อำเภอวารินชำราบ","อำเภอศรีเมืองใหม่","อำเภอสว่างวีระวงศ์","อำเภอสำโรง","อำเภอสิรินธร","อำเภอเหล่าเสือโก้ก","อำเภอเขมราฐ","อำเภอโขงเจียม","อำเภอเขื่องใน","อำเภอนาจะหลวย","อำเภอนาตาล","อำเภอน้ำขุ่น","อำเภอน้ำยืน","อำเภอบุณฑริก","อำเภอเบญจลักษ์","อำเภอกุดข้าวปุ้น","อำเภอโดมประดิษฐ์","อำเภอนาเยีย","อำเภอทุ่งศรีอุดม"
    ]
};
        

        function populateDistricts() {
            const provinceSelect = document.getElementById('province');
            const districtSelect = document.getElementById('district');
            const selectedProvinceValue = provinceSelect.value;

        
            districtSelect.innerHTML = '<option value="" disabled selected>--- เลือกอำเภอ/เขต ---</option>';

            if (selectedProvinceValue && THAI_DISTRICTS[selectedProvinceValue]) {

                const districts = THAI_DISTRICTS[selectedProvinceValue];


                districts.forEach(districtName => {
                    const option = document.createElement('option');
                    option.value = districtName; // ค่าที่ส่งไป
                    option.textContent = districtName; // ข้อความที่แสดง
                    districtSelect.appendChild(option);
                });

                districtSelect.disabled = false;
            } else {
               
                districtSelect.disabled = true;
            }
        }